<script setup lang="ts">
import { ref } from "vue";

const collapseOpenKey = ref("1");
const news = ref([
  {
    id: "1",
    title: "通知1",
    content:
      "滁州学院拥有全国普通高校中华优秀传统文化传承基地、安徽省重点实验室、安徽省新型产业共性技术研究中心等省部级科研平台12个，厅局级科研平台7个；建有省级示范实验实训中心、虚拟仿真实验教学中心、大学生创客实验室等15个。地理学获批安徽省“双一流”建设国内一流学科（B类），入选安徽省高等学校Ⅲ类高峰学科，电子信息、生物与医药2个学科获批安徽省应用型高峰培育学科。物联网工程、地理信息科学、食品质量与安全3个专业成功入选国家级一流本科专业建设点，测绘工程等17个专业被确定为省级一流本科专业建设点，建有省级特色（品牌）专业8个、省级专业综合改革试点12个，拥有的一流本科专业建设点数位居省内同类高校前列。企业共建校企合作班实现二级学院全覆盖。2022年起，地理信息科学、物联网工程、食品质量与安全、测绘工程等4个专业纳入本科一批招生。",
  },
  {
    id: "2",
    title: "通知2",
    content:
      "滁州学院拥有全国普通高校中华优秀传统文化传承基地、安徽省重点实验室、安徽省新型产业共性技术研究中心等省部级科研平台12个，厅局级科研平台7个；建有省级示范实验实训中心、虚拟仿真实验教学中心、大学生创客实验室等15个。地理学获批安徽省“双一流”建设国内一流学科（B类），入选安徽省高等学校Ⅲ类高峰学科，电子信息、生物与医药2个学科获批安徽省应用型高峰培育学科。物联网工程、地理信息科学、食品质量与安全3个专业成功入选国家级一流本科专业建设点，测绘工程等17个专业被确定为省级一流本科专业建设点，建有省级特色（品牌）专业8个、省级专业综合改革试点12个，拥有的一流本科专业建设点数位居省内同类高校前列。企业共建校企合作班实现二级学院全覆盖。2022年起，地理信息科学、物联网工程、食品质量与安全、测绘工程等4个专业纳入本科一批招生。",
  },
  {
    id: "3",
    title: "通知3",
    content:
      "滁州学院拥有全国普通高校中华优秀传统文化传承基地、安徽省重点实验室、安徽省新型产业共性技术研究中心等省部级科研平台12个，厅局级科研平台7个；建有省级示范实验实训中心、虚拟仿真实验教学中心、大学生创客实验室等15个。地理学获批安徽省“双一流”建设国内一流学科（B类），入选安徽省高等学校Ⅲ类高峰学科，电子信息、生物与医药2个学科获批安徽省应用型高峰培育学科。物联网工程、地理信息科学、食品质量与安全3个专业成功入选国家级一流本科专业建设点，测绘工程等17个专业被确定为省级一流本科专业建设点，建有省级特色（品牌）专业8个、省级专业综合改革试点12个，拥有的一流本科专业建设点数位居省内同类高校前列。企业共建校企合作班实现二级学院全覆盖。2022年起，地理信息科学、物联网工程、食品质量与安全、测绘工程等4个专业纳入本科一批招生。",
  },
]);
</script>

<template>
  <div class="container">
    <lay-notice-bar
      leftIcon="layui-icon-mute"
      rightIcon="layui-icon-close"
      text="事情总是会自动变化。顺其自然就好。"
      mode="closeable"
      background="#ecf5ff"
    ></lay-notice-bar>

    <div class="container__news">
      <lay-collapse v-model="collapseOpenKey">
        <lay-collapse-item v-for="item in news" :key="item.id" :title="item.title" :id="item.id">
          {{ item.content }}
        </lay-collapse-item>
      </lay-collapse>
    </div>
  </div>
</template>

<style lang="less" scoped>
.container {
  .container__news {
    padding: 20px 20%;
  }
}
</style>